Tekla.Structures.Model.CutPlane
The CutPlane class defines how the end of a part is cut with a plane. A cut plane differs from a fitting because
a cut can never extend the boundaries of the original part.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
Point Point = new Point(0, 0, 0);
Point Point2 = new Point(1000, 0, 0);
Beam Beam = new Beam();
Beam.StartPoint = Point;
Beam.EndPoint = Point2;
Beam.Profile.ProfileString = "HEA400";
Beam.Finish = "PAINT";
Beam.Insert();
CutPlane CutPlane = new CutPlane();
CutPlane.Plane = new Plane();
CutPlane.Plane.Origin = new Point(0, 0, 0);
CutPlane.Plane.AxisX = new Vector(0, 1000, 0);
CutPlane.Plane.AxisY = new Vector(0, 0, -1000);
CutPlane.Father = Beam;
CutPlane.Insert();
}
}

Tekla.Structures.Model.CutPlane.Plane
The plane that cuts the part.

Tekla.Structures.Model.CutPlane.#ctor
Initializes a new instance of the CutPlane class with empty attributes.

Tekla.Structures.Model.CutPlane.Insert
Inserts the cut plane into the model database. All the attributes must be set.
Returns: True on success.

Tekla.Structures.Model.CutPlane.Select
Selects a cut plane from the model database. The part ID must be set.
Returns: True on success.

Tekla.Structures.Model.CutPlane.Modify
Modifies the existing cut plane in the model database to match the current one.
Returns: True on success.

Tekla.Structures.Model.CutPlane.Delete
Deletes the cut plane instance with the given ID from the model database.
Returns: True on success.

Tekla.Structures.Model.CutPlane.CreateInstance


Tekla.Structures.Model.CutPlane.ModifyInstance


Tekla.Structures.Model.CutPlane.SelectInstance


Tekla.Structures.Model.CutPlane.ToStruct(Tekla.Structures.ModelInternal.dotFittingOrCutPlane_t@)


Tekla.Structures.Model.CutPlane.FromStruct(Tekla.Structures.ModelInternal.dotFittingOrCutPlane_t@)
